# Document for Problem_2 by Daeung-03
---


## 1.Run Without Debugging versus Start Debugging
실행속도 차이가 있다. Debugging이 체감 되는 수준으로 좀 더 느리다. 또 debugmode를 끄면 Start Debugging을 할 수 없다.
debug mode -> 상세한 오류 설명(특히 웹페이지에 바로 표시됨), 서버를 재시작 할 필요없이 수정 가능(저장하면 디버깅 -> 디버깅 끄면 바로 적용됨)

## 2.Flask의 역할
웹 프레임워크 -> 필요할 때 마다 웹페이지를 만들어내는 공장을 만들자. 이 때 필요한 생산 라인! 플라스크 문법과 템플릿을 활용해 반복적인 웹 페이지의 양식을 대체할 수 있다
웹 페이지는 수많은 링크(다른 html파일)로 구성되어 있음. 이렇게 되면 페이지를 수정할 때 마다 모든 html파일을 수정해야함. 그러나 flask는 사용자가 요청할 때 마다 웹 페이지를 찍어냄.
즉 동적으로 html 파일을 생성한다. 예를 들어 홈쇼핑 페이지에서 DB만 있으면 우리는 메인 페이지 - 상품 소개 페이지를 구성할 때 각 상품마다 페이지를 만드는 게 아니라 DB를 활용해 변수로 페이지를 작성하여
각 상품 소개 페이지를 만들 수 있음(이 때 사용하는 코드는 각 각 한 개씩 만드는 게 아니라 하나의 함수 처럼!)

## 3.(0.0.0.0)으로 설정 시 의미와 장단점
모든 호스트로 서버에 접속이 가능하다는 의미를 전달한다. 이 숫자의 양식은 물리적 주소라고 불리는 IP주소의 양식이다(Ipv4, 8비트 * 4). 이 때 0.0.0.0은 특정한 한 주소가 아니라 모든 IPv4주소를 대표하는 약속된 표기이다.
이는 파이썬 문법의 *과 같이 와일드카드 처럼 해석할 수 있다. 따라서 위와 같이 host를 지정하면 외부에서 접속이 가능하다(로컬이 아니어도). 그러나 오픈 되는 만큼 보안에 있어 신중해야한다. 방화벽 설정과 같은
보안 조치가 없다면 서버를 공격당할 수 있다. 

## 4.127.0.0.1 접속 vs 내부 IP 접속 차이
127.0.0.1로 접속하는 것 또한 자신의 컴퓨터에 접속할 때 사용하는 주소이다. 그러나 127.0.0.1은 예약된 특수 IP 주소, 루프백(Loopback)주소이기 때문에 네트워크를 거치지 않는다(127.x.x.x 모두). 즉 데이터가 바로 전달된다.
하지만 localhost로 접속하게 되면 DNS(Domain Name System)이나 host 파일을 거쳐 IP로 해석해서 접속한다. 즉 실제로 localhost 자체가 IP주소가 아니기 때문에 해석하는 과정이 추가되는 것이다. 또
주소체계에서 요즘은 Ipv6(16비트 * 8)도 사용하기 때문에 내부IP로 접속하면 ::1로도 변환될 수 있다(이는 시스템 설정에 따른다). 

## 5.포트 번호의 의미와 기본 충돌 시 해결 방안

